# encoding='utf-8
# @Time: 2024-01-08
# @File: %
#!/usr/bin/env
from icecream import ic
import os
lst = ['найсер дайсер овощерезка оригинал\t1',
       'найсер дайсер овощерезка оригинал\t1',
       'найсер дайсер овощерезка оригинал\t1',
       'найсер дайсер овощерезка оригинал\t1',
       'найсер дайсер овощерезка оригинал\t1',
       'найсер дайсер овощерезка оригинал\t1',
       'найсер дайсер овощерезка оригинал\t1',
       'найсер дайсер овощерезка оригинал\t1',
       '']
# 使用集合进行去重，同时保持顺序
result = list(set(lst))
print(result)
